-- Test finished
INSERT INTO result(alg,vertcount,edgecount,elenadd,conn,task,cycles,batchname,result) 
VALUES('empty',
          1000,
         49968,
            25,
            10,
    1125147000,
     561668348,
     'test001',
        'NONE');

-- Unable to find algorithm unknown_algorithm
INSERT INTO result(alg,vertcount,elenadd,conn,batchname,result) 
VALUES('unknown_algorithm',
1000,
25,
10,
'test001',
'ERROR');

-- Unknown switch found: unknownswitch
-- Test finished
INSERT INTO result(alg,vertcount,edgecount,elenadd,conn,task,cycles,batchname,result) 
VALUES('empty',
            10,
             7,
            25,
            10,
    1125147000,
     561329444,
     'test001',
        'NONE');

-- Unable to create JOB
INSERT INTO result(alg,vertcount,elenadd,conn,batchname,result) 
VALUES('empty',
50000,
25,
10,
'test001',
'ERROR');

-- Test finished
INSERT INTO result(alg,vertcount,edgecount,elenadd,conn,task,cycles,batchname,result) 
VALUES('dijkstra',
             1000,
            50084,
               25,
               10,
       1125147001,
         38980256,
        'test001',
'(@)Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,‘,B,a,,Ã');

-- Test finished
INSERT INTO result(alg,vertcount,edgecount,elenadd,conn,task,cycles,batchname,result) 
VALUES('dijkstra',
             1000,
            50084,
               25,
               10,
       1125147001,
         48375036,
        'test001',
'(@)Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,Í,‘,B,a,,Ã');

-- Test finished
INSERT INTO result(alg,vertcount,edgecount,elenadd,conn,task,cycles,batchname,result) 
VALUES('dijkstra',
               10,
                2,
               25,
               10,
       1125147001,
            34144,
        'test001',
           'NONE');

